import {
    convertLegacyPeriodCodeToActual,
    convertPeriodToHumanReadable,
} from '../autocode';

describe('Проверка адаптера формата периода', () => {
    describe('Единичный период', () => {
        it.each`
            input     | output    | desc
            ${'Y=1'}  | ${'Y=0'}  | ${'Текущий (по старому формату)'}
            ${'Y=0'}  | ${'Y=0'}  | ${'Текущий (по новому формату)'}
            ${'Y=10'} | ${'Y+10'} | ${'Некорректный будущий'}
            ${'Y=01'} | ${'Y=0'}  | ${'Текуший (по старому формату) с ведущим нулём'}
            ${'Y=02'} | ${'Y+2'}  | ${'Некорректный будущий с ведущим нулём'}
            ${'Y+1'}  | ${'Y+1'}  | ${'Следующий период'}
            ${'Y+01'} | ${'Y+1'}  | ${'Следующий период с ведущим нулём'}
            ${'Y+2'}  | ${'Y+2'}  | ${'Корректный будущий'}
            ${'HY-2'} | ${'HY-2'} | ${'Кооректный прошлый'}
            ${'Q-02'} | ${'Q-2'}  | ${'Некооректный прошлый'}
        `('$desc [$input -> $output]', ({ input, output }) => {
            expect(convertLegacyPeriodCodeToActual(input)).toBe(output);
        });
    });

    describe('Интервальный период', () => {
        it.each`
            input              | output           | desc
            ${'SY-1>EY=1'}     | ${'SY-1>EY=0'}   | ${'Прошлый -> Текущий (по старому формату)'}
            ${'SD=0>ED+7'}     | ${'SD=0>ED+7'}   | ${'Текущий (по новому формату) -> Будущий'}
            ${'SW-2>EW=2'}     | ${'SW-2>EW+2'}   | ${'Прошлый -> Некорректный будущий'}
            ${'SHY-02>SHY+02'} | ${'SHY-2>SHY+2'} | ${'Прошлый -> Будущий / с ведущим нулём'}
        `('$desc [$input -> $output]', ({ input, output }) => {
            expect(convertLegacyPeriodCodeToActual(input)).toBe(output);
        });
    });

    it('Произвольный период', () => {
        const period = 'S2026-06-30T00:00:00>E2026-07-31T23:59:59';
        expect(convertLegacyPeriodCodeToActual(period)).toBe(period);
    });

    it('Некорректное значение', () => {
        expect(convertLegacyPeriodCodeToActual('invalid value')).toBe(
            'invalid value'
        );
    });
});

describe('Проверка форматирования периода в человеко-читаемый вид', () => {
    describe('Единичный период', () => {
        it.each`
            input     | output                 | desc
            ${'Y=1'}  | ${'Этот год'}          | ${'Текущий (по старому формату)'}
            ${'Q=0'}  | ${'Текущий квартал'}   | ${'Текущий (по новому формату)'}
            ${'M+1'}  | ${'Следующий месяц'}   | ${'Следующий'}
            ${'W+2'}  | ${'+2 недели'}         | ${'Корректный будущий'}
            ${'HY-1'} | ${'Прошлое полугодие'} | ${'Предыдущий'}
            ${'Q-2'}  | ${'-2 квартала'}       | ${'Прошлый'}
            ${'D=0'}  | ${'Сегодня'}           | ${'Текущий день'}
            ${'D+1'}  | ${'Завтра'}            | ${'Следующий день'}
            ${'D+2'}  | ${'+2 дня'}            | ${'Будущий день'}
            ${'D-1'}  | ${'Вчера'}             | ${'Предыдущий день'}
            ${'D-2'}  | ${'-2 дня'}            | ${'Прошлый день'}
        `('$desc [$input -> $output]', ({ input, output }) => {
            expect(convertPeriodToHumanReadable(input)).toBe(output);
        });
    });

    describe('Интервальный период', () => {
        it.each`
            input            | output                                                 | desc
            ${'SY-1>EY=0'}   | ${'Начало Прошлый год > Окончание Этот год'}           | ${'Прошлый -> Текущий (по старому формату)'}
            ${'SD=0>ED+1'}   | ${'Начало Сегодня > Окончание Завтра'}                 | ${'Текущий (по новому формату) -> Следующий'}
            ${'SW-2>EW+2'}   | ${'Начало -2 недели > Окончание +2 недели'}            | ${'Прошлый -> Некорректный будущий'}
            ${'SHY-2>EHY-1'} | ${'Начало -2 полугодия > Окончание Прошлое полугодие'} | ${'Прошлый -> Предыдущий'}
            ${'EHY-1>SHY=5'} | ${'Окончание Прошлое полугодие > Начало +5 полугодий'} | ${'Прошлый <- Будущий'}
        `('$desc [$input -> $output]', ({ input, output }) => {
            expect(convertPeriodToHumanReadable(input)).toBe(output);
        });
    });

    it('Произвольный период', () => {
        const input = 'S2026-06-30T00:00:00>E2026-07-31T23:59:59';
        const output = 'От 30 июня 2026 г. до 31 июля 2026 г.';
        expect(convertPeriodToHumanReadable(input)).toBe(output);
    });

    it('Пустое значение', () => {
        expect(convertPeriodToHumanReadable('')).toBeUndefined();
    });

    it('Некорректное значение', () => {
        expect(() => convertPeriodToHumanReadable('invalid value')).toThrow(
            `Неправильный формат периода "invalid value"`
        );
    });
});
