const { decart } = require('../services');

describe(`предикаты`, () => {
    it(`декартово произведение`, () => {
        const a = [1, 2, 3];
        const b = ['один', 'два', 'три'];
        const c = ['право', 'лево'];

        expect([
            [
                [
                    [1, 'один', 'право'],
                    [1, 'один', 'лево'],
                ],
                [
                    [1, 'два', 'право'],
                    [1, 'два', 'лево'],
                ],
                [
                    [1, 'три', 'право'],
                    [1, 'три', 'лево'],
                ],
            ],
            [
                [
                    [2, 'один', 'право'],
                    [2, 'один', 'лево'],
                ],
                [
                    [2, 'два', 'право'],
                    [2, 'два', 'лево'],
                ],
                [
                    [2, 'три', 'право'],
                    [2, 'три', 'лево'],
                ],
            ],
            [
                [
                    [3, 'один', 'право'],
                    [3, 'один', 'лево'],
                ],
                [
                    [3, 'два', 'право'],
                    [3, 'два', 'лево'],
                ],
                [
                    [3, 'три', 'право'],
                    [3, 'три', 'лево'],
                ],
            ],
        ]).toMatchObject(decart([a, b, c]));
    });
});
